In [1]:
import pandas as pd
import sqlalchemy as alch

In [2]:
from getpass import getpass
password = getpass("Introduce your sql password: ")

Introduce your sql password: ········

In [5]:
# Create a Python connection with SQL database and retrieve the results of the last two queries
dbName="sakila"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
engine = alch.create_engine(connectionData)
print("I AM INNNNNN!!!!")

I AM INNNNNN!!!!

In [6]:
# Check the number of rentals for each customer for May
query = "SELECT customer_id, COUNT(rental_id) AS num_rentals FROM rentals_may GROUP BY customer_id ORDER BY num_rentals DESC"
rentals_may = pd.read_sql_query(query,engine)
rentals_may.head()

   customer_id  num_rentals
0          197            8
1          506            7
2          109            7
3          269            6
4          239            6

In [7]:
# Check the number of rentals for each customer for June
query = "SELECT customer_id, COUNT(rental_id) AS num_rentals FROM rentals_june GROUP BY customer_id ORDER BY num_rentals DESC;"
rentals_june = pd.read_sql_query(query,engine)
rentals_june.head()

   customer_id  num_rentals
0           31           11
1          454           10
2          329            9
3          295            9
4          561            9

In [8]:
# merge with Pandas
df = pd.merge(rentals_may, rentals_june, on='customer_id')
df.head()

   customer_id  num_rentals_x  num_rentals_y
0          197              8              8
1          506              7              5
2          109              7              5
3          269              6              3
4          239              6              5

In [10]:
df = df.rename(columns={"num_rentals_x":"num_rentals_may", "num_rentals_y":"num_rentals_june"})
df.head()

   customer_id  num_rentals_may  num_rentals_june
0          197                8                 8
1          506                7                 5
2          109                7                 5
3          269                6                 3
4          239                6                 5

In [11]:
# Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

In [24]:
def categorise(row):  
    if row['num_rentals_may'] > row['num_rentals_june']:
        return 'Bad'
    elif row['num_rentals_may'] < row['num_rentals_june']:
        return 'Good'
    return 'Fine'
# defining categories: 
# Good: rentals increased
# Bad: rentals decreased
# Fine: rentals stayed the same

In [25]:
df['rental_evolution'] = df.apply(lambda row: categorise(row), axis=1)
df.head()

   customer_id  num_rentals_may  num_rentals_june rental_evolution
0          197                8                 8             Fine
1          506                7                 5              Bad
2          109                7                 5              Bad
3          269                6                 3              Bad
4          239                6                 5              Bad

In [26]:
df

     customer_id  num_rentals_may  num_rentals_june rental_evolution
0            197                8                 8             Fine
1            506                7                 5              Bad
2            109                7                 5              Bad
3            269                6                 3              Bad
4            239                6                 5              Bad
..           ...              ...               ...              ...
507          234                1                 8             Good
508          431                1                 7             Good
509          351                1                 3             Good
510           10                1                 5             Good
511          136                1                 1             Fine

[512 rows x 4 columns]